/*
 *   @author Denis Troschenkov
 *   
 *   Homework №1
 */
#include​ ​<stdio.h>


//10. Дано целое число N (> 0). С помощью операций деления нацело и взятия остатка от деления определить, 
//имеются ли в записи числа N нечетные цифры. Если имеются, то вывести True, если нет — вывести False.
void​ solution1​ ();

//11. С клавиатуры вводятся числа, пока не будет введен 0. Подсчитать среднее арифметическое всех положительных четных чисел, 
//оканчивающихся на 8.
void​ solution2​ ();

//12. Написать функцию нахождения максимального из трех чисел.
void​ solution3​ ();


//13. * Написать функцию, генерирующую случайное число от 1 до 100.
//с использованием стандартной функции rand()
//без использования стандартной функции rand()
void​ solution4​ ();

//14. * Автоморфные числа. Натуральное число называется автоморфным, 
//если оно равно последним цифрам своего квадрата. Например, 25 \ :sup: 2 = 625. Напишите программу, 
//которая вводит натуральное число N и выводит на экран все автоморфные числа, не превосходящие N.
void​ solution5​ ();


int main () {
    return 0;
}